winstona-msoe/ce4950lab1/NetworkingProject.cydsn/Generated_Source/PSoC5/TIMER1.c
        /* Exit Critical Region*/
        CyExitCriticalSection(TIMER1_interruptState);

        #if (TIMER1_EnableTriggerMode)
            TIMER1_EnableTrigger();
        #endif /* Set Trigger enable bit for UDB implementation in the control register*/
		
		
        #if (TIMER1_InterruptOnCaptureCount && !TIMER1_UDB_CONTROL_REG_REMOVED)
            TIMER1_SetInterruptCount(TIMER1_INIT_INT_CAPTURE_COUNT);
        #endif /* Set interrupt count in UDB implementation if interrupt count feature is checked.*/

        TIMER1_ClearFIFO();
    #endif /* Configure additional features of UDB implementation */

    TIMER1_SetInterruptMode(TIMER1_INIT_INTERRUPT_MODE);
}


/*******************************************************************************
* Function Name: TIMER1_Enable
********************************************************************************
*
* Summary:
*  Enable the Timer
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER1_Enable(void) 
{
    /* Globally Enable the Fixed Function Block chosen */
    #if (TIMER1_UsingFixedFunction)
        TIMER1_GLOBAL_ENABLE |= TIMER1_BLOCK_EN_MASK;
        TIMER1_GLOBAL_STBY_ENABLE |= TIMER1_BLOCK_STBY_EN_MASK;
    #endif /* Set Enable bit for enabling Fixed function timer*/

    /* Remove assignment if control register is removed */
    #if (!TIMER1_UDB_CONTROL_REG_REMOVED || TIMER1_UsingFixedFunction)
        TIMER1_CONTROL |= TIMER1_CTRL_ENABLE;
    #endif /* Remove assignment if control register is removed */
}


/*******************************************************************************
* Function Name: TIMER1_Start
********************************************************************************
*
* Summary:
*  The start function initializes the timer with the default values, the
*  enables the timerto begin counting.  It does not enable interrupts,
*  the EnableInt command should be called if interrupt generation is required.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Global variables:
*  TIMER1_initVar: Is modified when this function is called for the
*   first time. Is used to ensure that initialization happens only once.
*
*******************************************************************************/
void TIMER1_Start(void) 
{
    if(TIMER1_initVar == 0u)
    {
        TIMER1_Init();

        TIMER1_initVar = 1u;   /* Clear this bit for Initialization */
    }

    /* Enable the Timer */
    TIMER1_Enable();
}


/*******************************************************************************
* Function Name: TIMER1_Stop
********************************************************************************
*
* Summary:
*  The stop function halts the timer, but does not change any modes or disable
*  interrupts.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Side Effects: If the Enable mode is set to Hardware only then this function
*               has no effect on the operation of the timer.
*
*******************************************************************************/
void TIMER1_Stop(void) 
{
    /* Disable Timer */
    #if(!TIMER1_UDB_CONTROL_REG_REMOVED || TIMER1_UsingFixedFunction)
        TIMER1_CONTROL &= ((uint8)(~TIMER1_CTRL_ENABLE));
    #endif /* Remove assignment if control register is removed */

    /* Globally disable the Fixed Function Block chosen */
    #if (TIMER1_UsingFixedFunction)
        TIMER1_GLOBAL_ENABLE &= ((uint8)(~TIMER1_BLOCK_EN_MASK));
        TIMER1_GLOBAL_STBY_ENABLE &= ((uint8)(~TIMER1_BLOCK_STBY_EN_MASK));
    #endif /* Disable global enable for the Timer Fixed function block to stop the Timer*/
}


/*******************************************************************************
* Function Name: TIMER1_SetInterruptMode
********************************************************************************
*
* Summary:
*  This function selects which of the interrupt inputs may cause an interrupt.
*  The twosources are caputure and terminal.  One, both or neither may
*  be selected.
*
* Parameters:
*  interruptMode:   This parameter is used to enable interrups on either/or
*                   terminal count or capture.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER1_SetInterruptMode(uint8 interruptMode) 
{
    TIMER1_STATUS_MASK = interruptMode;
}


/*******************************************************************************
* Function Name: TIMER1_SoftwareCapture
********************************************************************************
*
* Summary:
*  This function forces a capture independent of the capture signal.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Side Effects:
*  An existing hardware capture could be overwritten.
*
*******************************************************************************/
void TIMER1_SoftwareCapture(void) 
{
    /* Generate a software capture by reading the counter register */
    #if(TIMER1_UsingFixedFunction)
        (void)CY_GET_REG16(TIMER1_COUNTER_LSB_PTR);
    #else
        (void)CY_GET_REG8(TIMER1_COUNTER_LSB_PTR_8BIT);
    #endif/* (TIMER1_UsingFixedFunction) */
    /* Capture Data is now in the FIFO */
}


/*******************************************************************************
* Function Name: TIMER1_ReadStatusRegister
********************************************************************************
*
* Summary:
*  Reads the status register and returns it's state. This function should use
*  defined types for the bit-field information as the bits in this register may
*  be permuteable.
*
* Parameters:
*  void
*
* Return:
*  The contents of the status register
*
* Side Effects:
*  Status register bits may be clear on read.
*
*******************************************************************************/
uint8   TIMER1_ReadStatusRegister(void) 
{
    return (TIMER1_STATUS);
}


#if (!TIMER1_UDB_CONTROL_REG_REMOVED) /* Remove API if control register is unused */


/*******************************************************************************
* Function Name: TIMER1_ReadControlRegister
********************************************************************************
*
* Summary:
*  Reads the control register and returns it's value.
*
* Parameters:
*  void
*
* Return:
*  The contents of the control register
*
*******************************************************************************/
uint8 TIMER1_ReadControlRegister(void) 
{
    #if (!TIMER1_UDB_CONTROL_REG_REMOVED) 
        return ((uint8)TIMER1_CONTROL);
    #else
        return (0);
    #endif /* (!TIMER1_UDB_CONTROL_REG_REMOVED) */
}


