winstona-msoe/ce4950lab1/NetworkingProject.cydsn/Generated_Source/PSoC5/TIMER1.c
#if (TIMER1_SoftwareTriggerMode)


/*******************************************************************************
* Function Name: TIMER1_SetTriggerMode
********************************************************************************
*
* Summary:
*  This function sets the trigger input mode
*
* Parameters:
*  triggerMode: Pass one of the pre-defined Trigger Modes (except Software)
    #define TIMER1__B_TIMER__TM_NONE 0x00u
    #define TIMER1__B_TIMER__TM_RISINGEDGE 0x04u
    #define TIMER1__B_TIMER__TM_FALLINGEDGE 0x08u
    #define TIMER1__B_TIMER__TM_EITHEREDGE 0x0Cu
    #define TIMER1__B_TIMER__TM_SOFTWARE 0x10u
*
* Return:
*  void
*
*******************************************************************************/
void TIMER1_SetTriggerMode(uint8 triggerMode) 
{
    /* This must only set to two bits of the control register associated */
    triggerMode &= TIMER1_CTRL_TRIG_MODE_MASK;

    #if (!TIMER1_UDB_CONTROL_REG_REMOVED)   /* Remove assignment if control register is removed */
    
        /* Clear the Current Setting */
        TIMER1_CONTROL &= ((uint8)(~TIMER1_CTRL_TRIG_MODE_MASK));

        /* Write The New Setting */
        TIMER1_CONTROL |= (triggerMode | TIMER1__B_TIMER__TM_SOFTWARE);
    #endif /* Remove code section if control register is not used */
}
#endif /* Remove API if Trigger Mode is not Software Controlled */

#if (TIMER1_EnableTriggerMode)


/*******************************************************************************
* Function Name: TIMER1_EnableTrigger
********************************************************************************
*
* Summary:
*  Sets the control bit enabling Hardware Trigger mode
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER1_EnableTrigger(void) 
{
    #if (!TIMER1_UDB_CONTROL_REG_REMOVED)   /* Remove assignment if control register is removed */
        TIMER1_CONTROL |= TIMER1_CTRL_TRIG_EN;
    #endif /* Remove code section if control register is not used */
}


/*******************************************************************************
* Function Name: TIMER1_DisableTrigger
********************************************************************************
*
* Summary:
*  Clears the control bit enabling Hardware Trigger mode
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER1_DisableTrigger(void) 
{
    #if (!TIMER1_UDB_CONTROL_REG_REMOVED )   /* Remove assignment if control register is removed */
        TIMER1_CONTROL &= ((uint8)(~TIMER1_CTRL_TRIG_EN));
    #endif /* Remove code section if control register is not used */
}
#endif /* Remove API is Trigger Mode is set to None */

#if(TIMER1_InterruptOnCaptureCount)


/*******************************************************************************
* Function Name: TIMER1_SetInterruptCount
********************************************************************************
*
* Summary:
*  This function sets the capture count before an interrupt is triggered.
*
* Parameters:
*  interruptCount:  A value between 0 and 3 is valid.  If the value is 0, then
*                   an interrupt will occur each time a capture occurs.
*                   A value of 1 to 3 will cause the interrupt
*                   to delay by the same number of captures.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER1_SetInterruptCount(uint8 interruptCount) 
{
    /* This must only set to two bits of the control register associated */
    interruptCount &= TIMER1_CTRL_INTCNT_MASK;

    #if (!TIMER1_UDB_CONTROL_REG_REMOVED)
        /* Clear the Current Setting */
        TIMER1_CONTROL &= ((uint8)(~TIMER1_CTRL_INTCNT_MASK));
        /* Write The New Setting */
        TIMER1_CONTROL |= interruptCount;
    #endif /* (!TIMER1_UDB_CONTROL_REG_REMOVED) */
}
#endif /* TIMER1_InterruptOnCaptureCount */


#if (TIMER1_UsingHWCaptureCounter)


/*******************************************************************************
* Function Name: TIMER1_SetCaptureCount
********************************************************************************
*
* Summary:
*  This function sets the capture count
*
* Parameters:
*  captureCount: A value between 2 and 127 inclusive is valid.  A value of 1
*                to 127 will cause the interrupt to delay by the same number of
*                captures.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER1_SetCaptureCount(uint8 captureCount) 
{
    TIMER1_CAP_COUNT = captureCount;
}


/*******************************************************************************
* Function Name: TIMER1_ReadCaptureCount
********************************************************************************
*
* Summary:
*  This function reads the capture count setting
*
* Parameters:
*  void
*
* Return:
*  Returns the Capture Count Setting
*
*******************************************************************************/
uint8 TIMER1_ReadCaptureCount(void) 
{
    return ((uint8)TIMER1_CAP_COUNT);
}
#endif /* TIMER1_UsingHWCaptureCounter */


/*******************************************************************************
* Function Name: TIMER1_ClearFIFO
********************************************************************************
*
* Summary:
*  This function clears all capture data from the capture FIFO
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER1_ClearFIFO(void) 
{
    while(0u != (TIMER1_ReadStatusRegister() & TIMER1_STATUS_FIFONEMP))
    {
        (void)TIMER1_ReadCapture();
    }
}

#endif /* UDB Specific Functions */


/* [] END OF FILE */
